Бух_тест/src/Catalogs/ВидыДокументовФизическихЛиц/ВидыДокументовФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыДокументовФизическихЛиц</name>
  <predefined>
    <items>
      <name>ВодительскоеУдостоверение</name>
      <description>Водительское удостоверение</description>
    </items>
    <items>
      <name>ВоенныйБилет</name>
      <description>Военный билет</description>
    </items>
    <items>
      <name>ДипломатическийПаспорт</name>
      <description>Дипломатический паспорт гражданина Украины</description>
    </items>
    <items>
      <name>Загранпаспорт</name>
      <description>Загранпаспорт гражданина Украины</description>
    </items>
    <items>
      <name>Паспорт</name>
      <description>Паспорт гражданина Украины</description>
    </items>
    <items>
      <name>ПаспортМоряка</name>
      <description>Паспорт моряка</description>
    </items>
    <items>
      <name>СвидетельствоОРождении</name>
      <description>Свидетельство о рождении</description>
    </items>
  </predefined>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Бух_тест/src/CommonModules/ФизическиеЛицаКлиентСервер/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Физические лица"
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Возвращает тип серии документа удостоверяющего личность
//
// Параметры:
//	ВидДокумента - Справочник.ВидыДокументовФизическихЛиц
//
// Возвращаемое значение:
//	Число	- тип серии для документа, 0 - требований к серии нет
//
Функция ТипСерииДокументаУдостоверяющегоЛичность(ВидДокумента) Экспорт
	
	//*?
	//ТипДокумента = 0;
	//Если ВидДокумента = ПредопределенноеЗначение("Справочник.ВидыДокументовФизическихЛиц.ПаспортСССР")
	//	Или ВидДокумента = ПредопределенноеЗначение("Справочник.ВидыДокументовФизическихЛиц.СвидетельствоОРождении") Тогда
	//	ТипДокумента = 1;
	//	
	//ИначеЕсли ВидДокумента = ПредопределенноеЗначение("Справочник.ВидыДокументовФизическихЛиц.УдостоверениеОфицера")
	//	Или ВидДокумента = ПредопределенноеЗначение("Справочник.ВидыДокументовФизическихЛиц.ПаспортМинморфлота")
	//	Или ВидДокумента = ПредопределенноеЗначение("Справочник.ВидыДокументовФизическихЛиц.ВоенныйБилет")
	//	Или ВидДокумента = ПредопределенноеЗначение("Справочник.ВидыДокументовФизическихЛиц.ПаспортМоряка")
	//	Или ВидДокумента = ПредопределенноеЗначение("Справочник.ВидыДокументовФизическихЛиц.ВоенныйБилетОфицераЗапаса") Тогда
	//	ТипДокумента = 2;
	//	
	//ИначеЕсли ВидДокумента = ПредопределенноеЗначение("Справочник.ВидыДокументовФизическихЛиц.ЗагранпаспортСССР")
	//	Или ВидДокумента = ПредопределенноеЗначение("Справочник.ВидыДокументовФизическихЛиц.ДипломатическийПаспорт")
	//	Или ВидДокумента = ПредопределенноеЗначение("Справочник.ВидыДокументовФизическихЛиц.ЗагранпаспортРФ") Тогда
	//	ТипДокумента = 3;
	//	
	//ИначеЕсли ВидДокумента = ПредопределенноеЗначение("Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ") Тогда
	//	ТипДокумента = 4;
	//	
	//КонецЕсли;
	ТипДокумента = 4;
	
	Возврат ТипДокумента;
	
КонецФункции

// Возвращает тип номера документа удостоверяющего личность
//
// Параметры:
//	ВидДокумента - Справочник.ВидыДокументовФизическихЛиц
//
// Возвращаемое значение:
//	Число	- тип номера для документа, 0 - требований к номеру нет
//
Функция ТипНомераДокументаУдостоверяющегоЛичность(ВидДокумента) Экспорт
	
	ТипДокумента = 0;
	Если ВидДокумента = ПредопределенноеЗначение("Справочник.ВидыДокументовФизическихЛиц.СвидетельствоОРождении")
		Или ВидДокумента = ПредопределенноеЗначение("Справочник.ВидыДокументовФизическихЛиц.Паспорт") Тогда
		ТипДокумента = 1;
		
	ИначеЕсли ВидДокумента = ПредопределенноеЗначение("Справочник.ВидыДокументовФизическихЛиц.ДипломатическийПаспорт")
		Или ВидДокумента = ПредопределенноеЗначение("Справочник.ВидыДокументовФизическихЛиц.Загранпаспорт") Тогда
		ТипДокумента = 2;
		
	ИначеЕсли ВидДокумента = ПредопределенноеЗначение("Справочник.ВидыДокументовФизическихЛиц.ВоенныйБилет")
		Или ВидДокумента = ПредопределенноеЗначение("Справочник.ВидыДокументовФизическихЛиц.ПаспортМоряка") Тогда
		ТипДокумента = 3;
		
	КонецЕсли;
	
	Возврат ТипДокумента;
	
КонецФункции

// Проверяет, что серия документа для переданного вида документа указана правильно.
//
// Параметры:
//	ВидДокумента - СправочникСсылка.ВидыДокументовФизическихЛиц	- вид документа, для которого необходимо
//																проверить правильность серии
//	Серия - Строка												- серия документа
//	ТекстОшибки - Строка										- текст ошибки, если серия указана неправильно
//
// Возвращаемое значение:
//	Булево - результат проверки, Истина - правильно, Ложь - нет.
//
Функция СерияДокументаУказанаПравильно(ВидДокумента, Знач Серия , ТекстОшибки) Экспорт
	
	//ТипДокумента = ТипСерииДокументаУдостоверяющегоЛичность(ВидДокумента);
	//
	//Серия = СокрЛП(Серия);
	//
	//Если ТипДокумента = 1 Тогда // паспорт СССР и свидетельство о рождении
	//	
	//	Поз = Найти(Серия, "-");
	//	Если Поз = 0 Тогда
	//		ТекстОшибки = НСтр("ru='Серия документа должна состоять из двух частей, разделенных символом ""-"".';uk='Серія документа повинна складатися із двох частин, розділених символом ""-"".'");
	//		Возврат Ложь;
	//	КонецЕсли;
	//	
	//	ЧастьСерии1 = Лев(Серия, Поз - 1);
	//	ЧастьСерии2 = СокрЛП(Сред(Серия, Поз + 1));
	//	
	//	Поз = Найти(ЧастьСерии2, "-");
	//	Если Поз <> 0 Тогда
	//		ТекстОшибки = НСтр("ru='В серии документа должно быть только две группы символов.';uk='У серії документа повинне бути тільки дві групи символів.'");
	//		Возврат Ложь;
	//	КонецЕсли;
	//	
	//	Если ПустаяСтрока(ЧастьСерии1) Тогда
	//		ТекстОшибки = НСтр("ru='В серии документа отсутствует числовая часть.';uk='У серії документа відсутня числова частина.'");
	//		Возврат Ложь;
	//		
	//	ИначеЕсли  ПустаяСтрока(СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("IVXLC1УХЛС", ЧастьСерии1, "          ")) = 0 Тогда
	//		ТекстОшибки = НСтр("ru='Числовая часть серии документа должна указываться символами 1 У Х Л С  или  I V X L C.';uk='Числова частина серії документа повинна вказуватися символами 1 У Х Л С  або  I V X L C.'");
	//		Возврат Ложь;
	//		
	//	ИначеЕсли СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("IVXLC", ЧастьСерии1, "1УХЛС") <> СтроковыеФункцииКлиентСервер.ПреобразоватьЧислоВРимскуюНотацию(СтроковыеФункцииКлиентСервер.ПреобразоватьЧислоВАрабскуюНотацию(СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("IVXLC", ЧастьСерии1, "1УХЛС"))) Тогда
	//		ТекстОшибки = НСтр("ru='Числовая часть серии документа указана некорректно.';uk='Числова частина серії документа зазначена некоректно.'");
	//		Возврат Ложь;
	//		
	//	ИначеЕсли СтрДлина(ЧастьСерии2) <> 2 Или Не ПустаяСтрока(СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ", ЧастьСерии2, "                                 ")) Тогда
	//		ТекстОшибки = НСтр("ru='После разделителя ""-"" в серии документа должны быть ДВЕ pусcкие заглавные буквы.';uk='Після роздільника ""-"" у серії документа повинні бути ДВІ російські великі літери.'");
	//		Возврат Ложь;
	//		
	//	КонецЕсли;
	//	
	//ИначеЕсли ТипДокумента = 2 Тогда // серия - две буквы: военный билет, ...
	//	Если СтрДлина(Серия) <> 2 Или Не ПустаяСтрока(СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ", Серия, "                                 ")) Тогда
	//		ТекстОшибки = НСтр("ru='В серии документа должны быть ДВЕ pусcкие заглавные буквы.';uk='У серії документа повинні бути ДВІ російські великі літери.'");
	//		Возврат Ложь;
	//	КонецЕсли;
	//	
	//ИначеЕсли ТипДокумента = 3 Тогда // серия - две цифры: загранпаспорта
	//	Если СтрДлина(Серия) <> 2 Или Не ПустаяСтрока(СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("0123456789", Серия, "          ")) Тогда
	//		ТекстОшибки = НСтр("ru='В серии документа должно быть ДВЕ цифры.';uk='У серії документа повинне бути ДВІ цифри.'");
	//		Возврат Ложь;
	//	КонецЕсли;
	//	
	//ИначеЕсли ТипДокумента = 4 Тогда // серия - две группы цифр: новый паспорт
	//	Поз = Найти(Серия, " ");
	//	Если Поз = 0 Тогда
	//		ТекстОшибки = НСтр("ru='В серии документа должно быть две группы цифр.';uk='У серії документа повинне бути дві групи цифр.'");
	//		Возврат Ложь;
	//	КонецЕсли;
	//	
	//	ПерваяЧасть = Лев(Серия, Поз-1);
	//	ВтораяЧасть = СокрЛП(Сред(Серия, Поз+1));
	//	
	//	Поз = Найти(ВтораяЧасть, " ");
	//	Если Поз <> 0 Тогда
	//		ТекстОшибки = НСтр("ru='В серии документа должно быть только две группы цифр.';uk='У серії документа повинне бути тільки дві групи цифр.'");
	//		Возврат Ложь;
	//	КонецЕсли;
	//	
	//	Если СтрДлина(ПерваяЧасть) <> 2 Или Не ПустаяСтрока(СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("0123456789", ПерваяЧасть, "          ")) Тогда
	//		ТекстОшибки = НСтр("ru='Первая группа символов серии документа должна содержать две цифры.';uk='Перша група символів серії документа винна містити дві цифри.'");
	//		Возврат Ложь;
	//	КонецЕсли;
	//	
	//	Если СтрДлина(ВтораяЧасть) <> 2 Или Не ПустаяСтрока(СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("0123456789", ВтораяЧасть, "          ")) Тогда
	//		ТекстОшибки = НСтр("ru='Вторая группа символов серии документа должна содержать две цифры.';uk='Друга група символів серії документа повинна містити дві цифри.'");
	//		Возврат Ложь;
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//
	Возврат Истина;
	
КонецФункции

// Проверяет, что номер документа для переданного вида документа указан правильно.
//
// Параметры:
//	ВидДокумента - СправочникСсылка.ВидыДокументовФизическихЛиц	- вид документа, для которого необходимо
//																проверить правильность номера
//	Номер - Строка												- номер документа
//	ТекстОшибки - Строка										- текст ошибки, если номер указан неправильно
//
// Возвращаемое значение:
//	Булево - результат проверки, Истина - правильно, Ложь - нет.
//
Функция НомерДокументаУказанПравильно(ВидДокумента, Знач Номер, ТекстОшибки) Экспорт
	
	Если Не ПустаяСтрока(СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("0123456789", Номер, "          ")) Тогда
		ТекстОшибки = НСтр("ru='В номере документа присутствуют недопустимые символы.';uk='У номері документа присутні неприпустимі символи.'");
		Возврат Ложь;
	КонецЕсли;
	
	ТипДокумента = ТипНомераДокументаУдостоверяющегоЛичность(ВидДокумента);
	
	ДлинаНомера = СтрДлина(СокрЛП(Номер));
	
	Если ТипДокумента = 1 Тогда
		Если ДлинаНомера <> 6 Тогда
			ТекстОшибки = НСтр("ru='Номер документа должен состоять из 6 символов.';uk='Номер документа повинен складатися з 6 символів.'");
			Возврат Ложь;
		КонецЕсли;
		
	ИначеЕсли ТипДокумента = 2 Тогда
		Если ДлинаНомера <> 7 Тогда
			ТекстОшибки = НСтр("ru='Номер документа должен состоять из 7 символов.';uk='Номер документа повинен складатися з 7 символів.'");
			Возврат Ложь;
		КонецЕсли;
		
	ИначеЕсли ТипДокумента = 3 Тогда
		Если (ДлинаНомера < 6 ) Или ( ДлинаНомера > 7 ) Тогда
			ТекстОшибки = НСтр("ru='Номер документа должен состоять из 6 или 7 символов.';uk='Номер документа повинен складатися з 6 або 7 символів.'");
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Функция раскладывает ФИО в структуру
//
// Параметры:
//		ФИО - строка - наименование
//
// Возвращаемое значение:
//		СтруктураФИО - Структура с полями: Фамилия, Имя, Отчество
//
Функция ФамилияИмяОтчество(Знач ФИО) Экспорт
	
	СтруктураФИО = Новый Структура("Фамилия, Имя, Отчество");
	
	МассивПодстрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ФИО, " ");
	
	Если МассивПодстрок.Количество() > 0 Тогда
		СтруктураФИО.Вставить("Фамилия", МассивПодстрок[0]);
		Если МассивПодстрок.Количество() > 1 Тогда
			СтруктураФИО.Вставить("Имя", МассивПодстрок[1]);
		КонецЕсли;
		Если МассивПодстрок.Количество() > 2 Тогда
			СтруктураФИО.Вставить("Отчество", МассивПодстрок[2]);
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураФИО;
	
КонецФункции

// Проверяет верно ли написано ФИО
// ФИО может быть написано либо только на кириллице, либо только на латинице
// Также можно указать, что ФИО может быть верным только в кириллице
//
// Параметры:
//		СтрокаПараметр - строка - ФИО
//		ДопустимаТолькоКириллица - если Истина, то ФИО проверяется на кириллицу, латиница в этом случае считается ошибкой.
//									Ложь - ФИО считается верным, если оно написано либо на латинице, либо на кириллице.
//
// Возвращаемое значение:
//		Истина - ФИО написано верно, иначе Ложь
//
Функция ФИОНаписаноВерно(Знач СтрокаПараметр, ТолькоКириллица = Ложь) Экспорт
	
	ДопустимыеСимволы = "-";
	
	Возврат (НЕ ТолькоКириллица И СтроковыеФункцииКлиентСервер.ТолькоЛатиницаВСтроке(СтрокаПараметр, Ложь, ДопустимыеСимволы)) Или
			СтроковыеФункцииКлиентСервер.ТолькоКириллицаВСтроке(СтрокаПараметр, Ложь, ДопустимыеСимволы);
	
КонецФункции

// Проверяет соответствие ДРФО требованиям.
//
// Параметры:
//  ДРФО          	- Строка - Проверяемый индивидуальный номер налогоплательщика.
//  ТекстСообщения 	- Строка - Текст сообщения о найденных ошибках.
//
// Возвращаемое значение:
//  Истина       - ДРФО соответствует требованиям;
//  Ложь         - ДРФО не соответствует требованиям.
//
Функция ДРФОСоответствуетТребованиям(Знач ДРФО, ТекстСообщения) Экспорт

	СоответствуетТребованиям = Истина;
	ТекстСообщения = "";

	ДРФО      = СокрЛП(ДРФО);
	ДлинаДРФО = СтрДлина(ДРФО);

	Если НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ДРФО) Тогда
		СоответствуетТребованиям = Ложь;
		ТекстСообщения = ТекстСообщения + НСтр("ru='ДРФО должен состоять только из цифр.';uk='ДРФО повинен складатися тільки з цифр.'");
	КонецЕсли;

	Если  ДлинаДРФО <> 10 Тогда
		СоответствуетТребованиям = Ложь;
		ТекстСообщения = ТекстСообщения + ?(ЗначениеЗаполнено(ТекстСообщения), Символы.ПС, "")
		               + НСтр("ru='ДРФО физического лица должен состоять из 10 цифр.';uk='ДРФО фізичної особи повинен складатися з 10 цифр.'");
	КонецЕсли;

	Возврат СоответствуетТребованиям;

КонецФункции
